app/controllers/registrations_controller.rb

INSERT INTO `users` (`username`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('new@nav', 'test23@example.com', '$2a$10$N7SWapJ1V5p1QutIFYn.C.bQE78TSl/kZ9sfAQDj3Mrf1QxGWvbhi', '2015-05-09 14:58:04.843188', '2015-05-09 14:58:04.843188')
INSERT INTO `oauth_access_tokens` (`application_id`, `resource_owner_id`, `expires_in`, `token`, `created_at`) VALUES (1, 20, 604800, '2da4d624c3727a6b067cf15768d8dfcacf3792d1750d0d6660db21113c29960f', '2015-05-09 20:03:26.565529')
---
  def create
    application = Doorkeeper::Application.where(uid: params[:client_id]).first

    @user = User.new(sign_up_params)
    if @user.save
       access_token = AccessToken.create!(application_id: application.id,
         resource_owner_id: @user.id, :expires_in => 2.hours)