app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'test@example.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
 def create
      resource = User.find_for_database_authentication(:email => params[:user][:email])