app/controllers/sessions_controller.rb

 def create
      resource =  User.find(doorkeeper_token.resource_owner_id) if doorkeeper_token
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9  ORDER BY `users`.`id` ASC LIMIT 1